In [1]:
import pandas as pd

data = {
    'Student': ['Alice', 'Bob', 'Charlie', 'Alice', 'Bob', 'Charlie'],
    'Course': ['Math', 'History', 'Math', 'Biology', 'Biology', 'History']
}

df = pd.DataFrame(data)
df

   Student   Course
0    Alice     Math
1      Bob  History
2  Charlie     Math
3    Alice  Biology
4      Bob  Biology
5  Charlie  History

In [2]:
print(pd.crosstab(df['Student'], df['Course']))

Course   Biology  History  Math
Student
Alice          1        0     1
Bob            1        1     0
Charlie        0        1     1

In [4]:
print(pd.crosstab(df['Course'], df['Student']))

Student  Alice  Bob  Charlie
Course
Biology      1    1        0
History      0    1        1
Math         1    0        1

In [5]:
print(pd.crosstab(df['Student'], df['Course'], margins=True, margins_name="Total"))

Course   Biology  History  Math  Total
Student
Alice          1        0     1      2
Bob            1        1     0      2
Charlie        0        1     1      2
Total          2        2     2      6

In [ ]:
# Multiple columns

In [6]:
data['Exam'] = ['Midterm', 'Midterm', 'Final', 'Final', 'Midterm', 'Final']

df = pd.DataFrame(data)
df

   Student   Course     Exam
0    Alice     Math  Midterm
1      Bob  History  Midterm
2  Charlie     Math    Final
3    Alice  Biology    Final
4      Bob  Biology  Midterm
5  Charlie  History    Final

In [7]:
print(pd.crosstab([df['Student'], df['Exam']], df['Course']))

Course           Biology  History  Math
Student Exam
Alice   Final          1        0     0
        Midterm        0        0     1
Bob     Midterm        1        1     0
Charlie Final          0        1     1